# Управляющие последовательности
# Это список всех управляющих последовательностей, которые поддерживают­
# ся языком Python. Вам вряд ли понадобятся многие из них, но запомните их
# код и представление. Кроме того, опробуйте их в оболочке командной строки,
# чтобы понять, как они работают.

#Обратный слеш (\)
\\
#Одиночная кавычка (')
\' 
#Двойная кавычка (")
\" 
#ASCII-символ звонка (BEL)
\а 
#ASCII-символ возврата (BS)
\b
#ASCII-символ перевода страницы (FF)
\f 
#ASCII-символ новой строки (LF)
\n
#Символ с именем из базы данных Юникод(только Юникод)
\14{имя}
#ASCII-символ возврата каретки (CR)
\r
#ASCII-символ табуляции (TAB)
\t 
#16-битный символ Юникод со значением хххх (только Юникод)
\uxxxx 
#32-битный символ Юникод со значением хххххххх (только Юникод)
\Uxxxxxxxx 
#ASCII-символ отступа по вертикали (VT)
\v 
#Символ ASCII в восьмеричной нотации ооо
\ооо 
#Символ ASCII в шестнадцатеричной нотации hb
\xhh 
