a = input()
pos = 0
lst = []
# while a.find("f", pos) != -1:
#     #print(a.find("f", pos))
#     pos = a.find("f", pos) + 1
#     lst.append(pos)
# if len(lst) == 1:
#     print(a.find("f"))
# if len(lst) > 1:
#     print(lst[1], lst[-1])

    
# Дана строка. Если в этой строке буква f встречается только один раз, 
# выведите её индекс. Если она встречается два и более раз, 
# выведите индекс её первого и последнего появления. 
# Если буква f в данной строке не встречается, ничего не выводите. 
# При решении этой задачи нельзя использовать метод count и циклы.

print(a.find("f"))
